{
    "task_type": "CAUSAL_LM",
    "peft_type": "LORA",
    "auto_mapping": null,
    "base_model_name_or_path": "Qwen/Qwen2.5-7B-Instruct",
    "revision": null,
    "inference_mode": false,
    "r": 64,
    "target_modules": [
        "k_proj",
        "down_proj",
        "o_proj",
        "gate_proj",
        "q_proj",
        "up_proj",
        "v_proj"
    ],
    "exclude_modules": ".*visual.*",
    "lora_alpha": 128,
    "lora_dropout": 0.0,
    "fan_in_fan_out": false,
    "bias": "none",
    "use_rslora": false,
    "modules_to_save": null,
    "init_lora_weights": true,
    "layers_to_transform": null,
    "layers_pattern": null,
    "rank_pattern": {},
    "alpha_pattern": {},
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "trainable_token_indices": null,
    "loftq_config": {},
    "eva_config": null,
    "corda_config": null,
    "use_dora": false,
    "use_qalora": false,
    "qalora_group_size": 16,
    "layer_replication": null,
    "runtime_config": {
        "ephemeral_gpu_offload": false
    },
    "lora_bias": false
}